{
  "filename": "Resume_Ishit_Jain.pdf",
  "text": "\n\nIshit Jain\nI+91 9001975645#jainishit46@gmail.com§ishitcode/ïishit-jain Linkedin\nCareer Objective\nMotivated and enthusiastic fresher seeking challenging roles in a dynamic organization to apply skills, knowledge,\nand academic background for company growth. Committed to continuous learning and professional development\nthrough practical exposure in internships and job opportunities.\nEducation\nSRM Institute of Science and Technology, Chennai\nSeptember 2022 – Present\nB.Tech in Computer Science with Spl. in Cyber SecurityCGPA: 9.55.\nCambridge Court World School, JaipurApril 2021 – March 2022\nClass XII (Senior Secondary Examination, CBSE)Percentage: 91.00%.\nST. Anselm Pink City Sr. Sec. School, JaipurApril 2019 - March 2020\nClass X (Secondary Examination, CBSE)Percentage: 89.20%.\nExperience\nSamsung R&D Institute India| PRISM Intern | Remote\nDecember 2024 – June 2025\n•\nBuilt a system for duplicate memory detection using XXHash and GXHash on x86-64 and Android ARM64.\n•\nApplied page-aligned chunking and NEON-based SIMD hashing for efficient deduplication.\n•\nAnalyzed live memory via parsed linux files to simulate Kernel Samepage Merging (KSM).\n•\nEnabled architecture-agnostic operation across Linux and Android using cross-compilation.\nProjects\nHireAI - Smart Interview Automation System\n•\nBuilt a scalable Node.js and Express backend with a modular architecture and RESTful APIs.\n•\nImplemented PDF parsing and Gemini API integration to extract and analyze resume data.\n•\nDesigned AI-driven matching of resumes with job descriptions to generate personalized interview questions.\n•\nAutomated candidate voice interviews using Bland API with Twilio notifications for scalable, unbiased screening.\nZephyr Space\n•\nDeveloped a Streamlit web app for book search, Q&A on summaries, and personalized recommendations.\n•\nIntegrated Google Books API with Gemini and LangChain for NLP-driven features using Python.\n•\nImplemented sentiment analysis and dynamic reading list generation tailored to user preferences.\nSkills\n•\nTechnical:C++, Python, Java, MySQL, JavaScript, React, Node.js, Express.js, MongoDB.\n•\nSoft Skills:Time Management, Teamwork, Problem-Solving, Engaging Presentation , Leadership .\nAchievements\n•\nSecuredThirdplace at theAWS Gen AI Workshop Ideathonfor developingGymbro, a personalized fitness app\npowered by AWS PartyRock with tailored fitness plans to enhance user engagement and accessibility.\nCertifications\n•\nEC-Council Certified Ethical Hacker (2025).\n•\nFundamentals of Object-Oriented Programming (NPTEL, 2025).\n•\nAWS Machine Learning Foundation (2024).",
  "uploadedAt": "2025-09-07T19:15:31.540Z"
}